spec/support/vcr_cassettes/bgs/vnp_ptcpnt_service/vnp_ptcpnt_create.yml

---
http_interactions:
- request:
    method: get
    uri: <BGS_BASE_URL>/VnpPtcpntWebServiceBean/VnpPtcpntService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v2.9.0
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 26 Mar 2024 21:28:36 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
      Strict-Transport-Security:
      - max-age=16000000; includeSubDomains; preload;
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-wls122140-b230824.1031 svn-revision#e4bad6ac24018736698e2952f77e76e7f403a9f1. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-wls122140-b230824.1031 svn-revision#e4bad6ac24018736698e2952f77e76e7f403a9f1. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ptcpntService.services.vonapp.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ptcpntService.services.vonapp.vba.va.gov/" name="VnpPtcpntService">
        <types>
        <xsd:schema>
        <xsd:import namespace="http://ptcpntService.services.vonapp.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/VnpPtcpntWebServiceBean/VnpPtcpntService?xsd=1"/>
        </xsd:schema>
        </types>
        <message name="vnpPtcpntCreate">
        <part name="parameters" element="tns:vnpPtcpntCreate"/>
        </message>
        <message name="vnpPtcpntCreateResponse">
        <part name="parameters" element="tns:vnpPtcpntCreateResponse"/>
        </message>
        <message name="MessageFaultException">
        <part name="fault" element="tns:MessageFaultException"/>
        </message>
        <message name="vnpPtcpntUpdate">
        <part name="parameters" element="tns:vnpPtcpntUpdate"/>
        </message>
        <message name="vnpPtcpntUpdateResponse">
        <part name="parameters" element="tns:vnpPtcpntUpdateResponse"/>
        </message>
        <message name="vnpPtcpntRemove">
        <part name="parameters" element="tns:vnpPtcpntRemove"/>
        </message>
        <message name="vnpPtcpntRemoveResponse">
        <part name="parameters" element="tns:vnpPtcpntRemoveResponse"/>
        </message>
        <message name="findAllAsArray">
        <part name="parameters" element="tns:findAllAsArray"/>
        </message>
        <message name="findAllAsArrayResponse">
        <part name="parameters" element="tns:findAllAsArrayResponse"/>
        </message>
        <message name="vnpPtcpntFindByPrimaryKey">
        <part name="parameters" element="tns:vnpPtcpntFindByPrimaryKey"/>
        </message>
        <message name="vnpPtcpntFindByPrimaryKeyResponse">
        <part name="parameters" element="tns:vnpPtcpntFindByPrimaryKeyResponse"/>
        </message>
        <portType name="VnpPtcpntService">
        <operation name="vnpPtcpntCreate">
        <input wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/vnpPtcpntCreateRequest" message="tns:vnpPtcpntCreate"/>
        <output wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/vnpPtcpntCreateResponse" message="tns:vnpPtcpntCreateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/vnpPtcpntCreate/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntUpdate">
        <input wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/vnpPtcpntUpdateRequest" message="tns:vnpPtcpntUpdate"/>
        <output wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/vnpPtcpntUpdateResponse" message="tns:vnpPtcpntUpdateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/vnpPtcpntUpdate/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntRemove">
        <input wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/vnpPtcpntRemoveRequest" message="tns:vnpPtcpntRemove"/>
        <output wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/vnpPtcpntRemoveResponse" message="tns:vnpPtcpntRemoveResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/vnpPtcpntRemove/Fault/MessageFaultException"/>
        </operation>
        <operation name="findAllAsArray">
        <input wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/findAllAsArrayRequest" message="tns:findAllAsArray"/>
        <output wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/findAllAsArrayResponse" message="tns:findAllAsArrayResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/findAllAsArray/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntFindByPrimaryKey">
        <input wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/vnpPtcpntFindByPrimaryKeyRequest" message="tns:vnpPtcpntFindByPrimaryKey"/>
        <output wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/vnpPtcpntFindByPrimaryKeyResponse" message="tns:vnpPtcpntFindByPrimaryKeyResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://ptcpntService.services.vonapp.vba.va.gov/VnpPtcpntService/vnpPtcpntFindByPrimaryKey/Fault/MessageFaultException"/>
        </operation>
        </portType>
        <binding name="VnpPtcpntServicePortBinding" type="tns:VnpPtcpntService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="vnpPtcpntCreate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntUpdate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntRemove">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="findAllAsArray">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntFindByPrimaryKey">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        </binding>
        <service name="VnpPtcpntService">
        <port name="VnpPtcpntServicePort" binding="tns:VnpPtcpntServicePortBinding">
        <soap:address location="http://linktestbepbenefits.vba.va.gov:80/VnpPtcpntWebServiceBean/VnpPtcpntService"/>
        </port>
        </service>
        </definitions>
  recorded_at: Tue, 26 Mar 2024 21:28:36 GMT
- request:
    method: post
    uri: <BGS_BASE_URL>/VnpPtcpntWebServiceBean/VnpPtcpntService
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
          <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://ptcpntService.services.vonapp.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
          <env:Header>
          <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
              <wsse:Username>VAgovAPI</wsse:Username>
            </wsse:UsernameToken>
            <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
              <vaws:CLIENT_MACHINE>10.0.0.9</vaws:CLIENT_MACHINE>
              <vaws:STN_ID>281</vaws:STN_ID>
              <vaws:applicationName>VAgovAPI</vaws:applicationName>
              <vaws:ExternalUid>xUid</vaws:ExternalUid>
              <vaws:ExternalKey>xKey</vaws:ExternalKey>
            </vaws:VaServiceHeaders>
          </wsse:Security>
        </env:Header>

          <env:Body>
            <tns:vnpPtcpntCreate>
              <arg0>
          <vnpProcId>3854437</vnpProcId>
          <vnpPtcpntId xsi:nil="true"/>
          <fraudInd xsi:nil="true"/>
          <jrnDt>2020-07-16T18:20:17Z</jrnDt>
          <jrnLctnId>281</jrnLctnId>
          <jrnObjId>VAgovAPI</jrnObjId>
          <jrnStatusTypeCd>U</jrnStatusTypeCd>
          <jrnUserId>VAgovAPI</jrnUserId>
          <legacyPoaCd xsi:nil="true"/>
          <miscVendorInd xsi:nil="true"/>
          <ptcpntShortNm xsi:nil="true"/>
          <ptcpntTypeNm>Person</ptcpntTypeNm>
          <taxIdfctnNbr xsi:nil="true"/>
          <tinWaiverReasonTypeCd xsi:nil="true"/>
          <ptcpntFkPtcpntId xsi:nil="true"/>
          <corpPtcpntId xsi:nil="true"/>
        </arg0>

            </tns:vnpPtcpntCreate>
          </env:Body>
          </env:Envelope>
    headers:
      User-Agent:
      - Faraday v2.9.0
      Content-Type:
      - text/xml;charset=UTF-8
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpPtcpntCreate"'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 26 Mar 2024 21:28:37 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
      Strict-Transport-Security:
      - max-age=16000000; includeSubDomains; preload;
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=</work:WorkContext></env:Header><S:Body><ns0:vnpPtcpntCreateResponse
        xmlns:ns0="http://ptcpntService.services.vonapp.vba.va.gov/"><return><vnpPtcpntId>181913</vnpPtcpntId><vnpProcId>3854437</vnpProcId><jrnDt>2020-07-16T18:20:17Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><ptcpntTypeNm>Person</ptcpntTypeNm></return></ns0:vnpPtcpntCreateResponse></S:Body></S:Envelope>
  recorded_at: Tue, 26 Mar 2024 21:28:37 GMT
recorded_with: VCR 6.2.0
