spec/support/vcr_cassettes/bgs/base/create_participant.yml

---
http_interactions:
- request:
    method: get
    uri: https://localhost:4447/VnpPtcpntWebServiceBean/VnpPtcpntService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Host:
      - ".vba.va.gov"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 23 Apr 2020 00:07:12 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ptcpntService.services.vonapp.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ptcpntService.services.vonapp.vba.va.gov/" name="VnpPtcpntService">
        <types>
        <xsd:schema>
        <xsd:import namespace="http://ptcpntService.services.vonapp.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/VnpPtcpntWebServiceBean/VnpPtcpntService?xsd=1"/>
        </xsd:schema>
        </types>
        <message name="vnpPtcpntUpdate">
        <part name="parameters" element="tns:vnpPtcpntUpdate"/>
        </message>
        <message name="vnpPtcpntUpdateResponse">
        <part name="parameters" element="tns:vnpPtcpntUpdateResponse"/>
        </message>
        <message name="MessageFaultException">
        <part name="fault" element="tns:MessageFaultException"/>
        </message>
        <message name="vnpPtcpntCreate">
        <part name="parameters" element="tns:vnpPtcpntCreate"/>
        </message>
        <message name="vnpPtcpntCreateResponse">
        <part name="parameters" element="tns:vnpPtcpntCreateResponse"/>
        </message>
        <message name="vnpPtcpntRemove">
        <part name="parameters" element="tns:vnpPtcpntRemove"/>
        </message>
        <message name="vnpPtcpntRemoveResponse">
        <part name="parameters" element="tns:vnpPtcpntRemoveResponse"/>
        </message>
        <message name="vnpPtcpntFindByPrimaryKey">
        <part name="parameters" element="tns:vnpPtcpntFindByPrimaryKey"/>
        </message>
        <message name="vnpPtcpntFindByPrimaryKeyResponse">
        <part name="parameters" element="tns:vnpPtcpntFindByPrimaryKeyResponse"/>
        </message>
        <message name="findAllAsArray">
        <part name="parameters" element="tns:findAllAsArray"/>
        </message>
        <message name="findAllAsArrayResponse">
        <part name="parameters" element="tns:findAllAsArrayResponse"/>
        </message>
        <portType name="VnpPtcpntService">
        <operation name="vnpPtcpntUpdate">
        <input message="tns:vnpPtcpntUpdate"/>
        <output message="tns:vnpPtcpntUpdateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntCreate">
        <input message="tns:vnpPtcpntCreate"/>
        <output message="tns:vnpPtcpntCreateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntRemove">
        <input message="tns:vnpPtcpntRemove"/>
        <output message="tns:vnpPtcpntRemoveResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntFindByPrimaryKey">
        <input message="tns:vnpPtcpntFindByPrimaryKey"/>
        <output message="tns:vnpPtcpntFindByPrimaryKeyResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="findAllAsArray">
        <input message="tns:findAllAsArray"/>
        <output message="tns:findAllAsArrayResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        </portType>
        <binding name="VnpPtcpntServicePortBinding" type="tns:VnpPtcpntService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="vnpPtcpntUpdate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntCreate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntRemove">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntFindByPrimaryKey">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="findAllAsArray">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        </binding>
        <service name="VnpPtcpntService">
        <port name="VnpPtcpntServicePort" binding="tns:VnpPtcpntServicePortBinding">
        <soap:address location="http://linktestbepbenefits.vba.va.gov:80/VnpPtcpntWebServiceBean/VnpPtcpntService"/>
        </port>
        </service>
        </definitions>
    http_version: null
  recorded_at: Thu, 23 Apr 2020 00:07:12 GMT
- request:
    method: post
    uri: http://linktestbepbenefits.vba.va.gov/VnpPtcpntWebServiceBean/VnpPtcpntService
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://ptcpntService.services.vonapp.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken>
            <wsse:Username>VAgovAPI</wsse:Username>
          </wsse:UsernameToken>
          <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
            <vaws:CLIENT_MACHINE>10.0.0.147</vaws:CLIENT_MACHINE>
            <vaws:STN_ID>281</vaws:STN_ID>
            <vaws:applicationName>VAgovAPI</vaws:applicationName>
            <vaws:ExternalUid>58859066071384793</vaws:ExternalUid>
            <vaws:ExternalKey>abraham.lincoln@vets.gov</vaws:ExternalKey>
          </vaws:VaServiceHeaders>
        </wsse:Security>
        </env:Header><env:Body><tns:vnpPtcpntCreate><arg0><vnpPtcpntId xsi:nil="true"/><vnpProcId>3828033</vnpProcId><fraudInd xsi:nil="true"/><jrnDt>2020-04-23T00:07:11Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>I</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><legacyPoaCd xsi:nil="true"/><miscVendorInd xsi:nil="true"/><ptcpntShortNm xsi:nil="true"/><ptcpntTypeNm>Person</ptcpntTypeNm><taxIdfctnNbr xsi:nil="true"/><tinWaiverReasonTypeCd xsi:nil="true"/><ptcpntFkPtcpntId xsi:nil="true"/><corpPtcpntId xsi:nil="true"/></arg0></tns:vnpPtcpntCreate></env:Body></env:Envelope>
    headers:
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpPtcpntCreate"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1484'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx/1.17.9
      Date:
      - Thu, 23 Apr 2020 00:07:13 GMT
      Content-Type:
      - text/xml; charset=utf-8
      Content-Length:
      - '931'
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=</work:WorkContext></S:Header><S:Body><ns2:vnpPtcpntCreateResponse
        xmlns:ns2="http://ptcpntService.services.vonapp.vba.va.gov/"><return><vnpPtcpntId>146189</vnpPtcpntId><vnpProcId>3828033</vnpProcId><fraudInd></fraudInd><jrnDt>2020-04-23T00:07:11Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>I</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><legacyPoaCd></legacyPoaCd><miscVendorInd></miscVendorInd><ptcpntShortNm></ptcpntShortNm><ptcpntTypeNm>Person</ptcpntTypeNm><taxIdfctnNbr></taxIdfctnNbr><tinWaiverReasonTypeCd></tinWaiverReasonTypeCd></return></ns2:vnpPtcpntCreateResponse></S:Body></S:Envelope>
    http_version: null
  recorded_at: Thu, 23 Apr 2020 00:07:13 GMT
recorded_with: VCR 5.1.0
